<template>
    <div>
        <div class="custom-container" style="min-height: 100vh">

            <div class="match-container-page">

                <div class="head-line new mb-4">
                    <div class="d-flex align-items-center">
                        <h4 class="d-none d-xl-block d-lg-block"> دوريات وبطولات </h4>
                        <h4> | الدوري السعودي </h4>
                        <span class="neww">
                            | مباراة الفتح والأخدود
                        </span>
                    </div>
                </div>


                <div class="match">

                    <div class="text-container">
                        <span class="leg"> الدوري السعودي - الأسبوع الحادي عشر </span>
                        <span class="time"> 30 ديسمبر 2023 | 09:37 ص</span>

                        <div class="clups">
                            <div class="image d-flex align-item-center gap-3 flex-column flex-xl-row flex-lg-row ">
                                <img  src="../assets/images/clup3.png" alt="">

                                <h5 class="mt-1"> الفتح </h5>
                            </div>
                            <div class="score">
                                <div>
                                    <div class="line"></div>
                                </div>
                                <div class="divider"></div>
                                <div>
                                    <div class="line"></div>
                                </div>
                            </div>
                            <div class="image d-flex align-item-center gap-3 flex-column flex-xl-row flex-lg-row">
                                <h5 class="mt-1"> الأخدود </h5>
                                <img src="../assets/images/clup4.png" alt="">
                            </div>
                        </div>

                        <div class="watch">
                            <div class="d-flex align-items-center gap-2">
                                <span class="active"> شاهد المباراة </span>
                                <svg xmlns="http://www.w3.org/2000/svg" width="18" height="19" viewBox="0 0 18 19"
                                    fill="none">
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                        d="M8.9998 16.7C10.9094 16.7 12.7407 15.9415 14.091 14.5912C15.4412 13.241 16.1998 11.4096 16.1998 9.50005C16.1998 7.59049 15.4412 5.75914 14.091 4.40888C12.7407 3.05862 10.9094 2.30005 8.9998 2.30005C7.09025 2.30005 5.2589 3.05862 3.90864 4.40888C2.55837 5.75914 1.7998 7.59049 1.7998 9.50005C1.7998 11.4096 2.55837 13.241 3.90864 14.5912C5.2589 15.9415 7.09025 16.7 8.9998 16.7ZM8.59931 6.95125C8.46376 6.86082 8.30622 6.80888 8.14347 6.80097C7.98072 6.79307 7.81888 6.82949 7.67522 6.90636C7.53155 6.98323 7.41145 7.09766 7.32772 7.23744C7.24399 7.37722 7.19978 7.53711 7.1998 7.70005V11.3C7.19978 11.463 7.24399 11.6229 7.32772 11.7627C7.41145 11.9024 7.53155 12.0169 7.67522 12.0937C7.81888 12.1706 7.98072 12.207 8.14347 12.1991C8.30622 12.1912 8.46376 12.1393 8.59931 12.0488L11.2993 10.2488C11.4226 10.1667 11.5236 10.0553 11.5935 9.92469C11.6634 9.79406 11.7 9.6482 11.7 9.50005C11.7 9.3519 11.6634 9.20604 11.5935 9.07541C11.5236 8.94479 11.4226 8.83344 11.2993 8.75125L8.59931 6.95125Z"
                                        fill="#B41618" />
                                </svg>
                            </div>
                            <div class="d-flex align-items-center gap-2">
                                <span class=""> ستاد السلام </span>
                                <svg xmlns="http://www.w3.org/2000/svg" width="18" height="19" viewBox="0 0 18 19"
                                    fill="none">
                                    <g clip-path="url(#clip0_1_3173)">
                                        <path
                                            d="M9 3.125C7.00275 3.125 5.00775 2.98325 3.03 2.7005L0.75 2.375H0.375V16.625H0.75L3.03 16.2995C5.00745 16.0169 7.00246 15.8751 9 15.875M9 3.125C10.9973 3.125 12.9922 2.98325 14.97 2.7005L17.25 2.375H17.625V16.625H17.25L14.97 16.2995C12.9926 16.0169 10.9975 15.8751 9 15.875M9 3.125V7.25M9 15.875V11.75M9 7.25C9.59674 7.25 10.169 7.48705 10.591 7.90901C11.0129 8.33097 11.25 8.90326 11.25 9.5C11.25 10.0967 11.0129 10.669 10.591 11.091C10.169 11.5129 9.59674 11.75 9 11.75M9 7.25C8.40326 7.25 7.83097 7.48705 7.40901 7.90901C6.98705 8.33097 6.75 8.90326 6.75 9.5C6.75 10.0967 6.98705 10.669 7.40901 11.091C7.83097 11.5129 8.40326 11.75 9 11.75M0.375 6.125H0.75C1.64511 6.125 2.50355 6.48058 3.13649 7.11351C3.76942 7.74645 4.125 8.60489 4.125 9.5C4.125 10.3951 3.76942 11.2535 3.13649 11.8865C2.50355 12.5194 1.64511 12.875 0.75 12.875H0.375M17.625 12.875H17.25C16.3549 12.875 15.4965 12.5194 14.8635 11.8865C14.2306 11.2535 13.875 10.3951 13.875 9.5C13.875 8.60489 14.2306 7.74645 14.8635 7.11351C15.4965 6.48058 16.3549 6.125 17.25 6.125H17.625"
                                            stroke="#7A7A7A" />
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_1_3173">
                                            <rect width="18" height="18" fill="white" transform="translate(0 0.5)" />
                                        </clipPath>
                                    </defs>
                                </svg>
                            </div>
                        </div>
                    </div>


                    <div class="collection">
                        <div @click="channelBtn = 1, channelBtnActive = true" :class="{ 'active': channelBtn == 1 }"
                            class="d-flex chan align-items-center w-100 justify-content-between  gap-2">
                            <span> Ontime sports </span>
                            <svg xmlns="http://www.w3.org/2000/svg" width="18" height="19" viewBox="0 0 18 19" fill="none">
                                <g clip-path="url(#clip0_1_3168)">
                                    <path
                                        d="M13.7596 0.499996C13.6045 0.516667 13.4596 0.585216 13.3484 0.694534L9 5.04361L6.72854 2.77077C6.66308 2.70535 6.58538 2.65347 6.49987 2.61809C6.41436 2.5827 6.32272 2.56451 6.23018 2.56454C6.13764 2.56457 6.04601 2.58283 5.96053 2.61827C5.87504 2.65372 5.79738 2.70565 5.73196 2.77111C5.59985 2.90331 5.52567 3.08258 5.52574 3.26947C5.52577 3.36201 5.54403 3.45364 5.57947 3.53912C5.61491 3.62461 5.66685 3.70227 5.73231 3.76769L8.00446 6.03846H2.07692C1.52609 6.03846 0.997815 6.25728 0.608317 6.64677C0.218818 7.03627 0 7.56455 0 8.11538L0 16.4231C0 16.9739 0.218818 17.5022 0.608317 17.8917C0.997815 18.2812 1.52609 18.5 2.07692 18.5H15.9231C16.4739 18.5 17.0022 18.2812 17.3917 17.8917C17.7812 17.5022 18 16.9739 18 16.4231V8.11538C18 7.56455 17.7812 7.03627 17.3917 6.64677C17.0022 6.25728 16.4739 6.03846 15.9231 6.03846H9.99485L14.3439 1.69007C14.4529 1.58879 14.5263 1.4551 14.5533 1.30882C14.5804 1.16254 14.5595 1.01144 14.494 0.877913C14.4284 0.744382 14.3216 0.63552 14.1893 0.567452C14.0571 0.499384 13.9064 0.475731 13.7596 0.499996ZM7.26923 7.42307C12.4235 7.42307 13.1538 7.43761 13.1538 12.2692C13.1538 17.1015 12.3729 17.1154 7.26923 17.1154C2.142 17.1154 1.38462 17.0641 1.38462 12.2692C1.38462 7.47569 2.142 7.42307 7.26923 7.42307ZM15.5769 9.45707C16.1765 9.45707 16.659 9.93892 16.659 10.5385C16.6593 10.6806 16.6315 10.8215 16.5772 10.9529C16.5229 11.0843 16.4432 11.2037 16.3427 11.3042C16.2421 11.4047 16.1227 11.4844 15.9913 11.5387C15.8599 11.593 15.7191 11.6208 15.5769 11.6205C15.4347 11.6209 15.2938 11.5932 15.1624 11.5389C15.0309 11.4847 14.9115 11.405 14.811 11.3044C14.7104 11.2039 14.6307 11.0844 14.5765 10.953C14.5222 10.8215 14.4945 10.6807 14.4948 10.5385C14.4946 10.3963 14.5224 10.2554 14.5767 10.124C14.6309 9.99263 14.7106 9.87324 14.8112 9.7727C14.9117 9.67217 15.0311 9.59247 15.1625 9.53819C15.2939 9.48391 15.4347 9.4568 15.5769 9.45707ZM15.5769 12.2263C16.1765 12.2263 16.659 12.7082 16.659 13.3077C16.6593 13.4499 16.6315 13.5907 16.5772 13.7221C16.5229 13.8535 16.4432 13.9729 16.3427 14.0734C16.2421 14.174 16.1227 14.2537 15.9913 14.308C15.8599 14.3622 15.7191 14.39 15.5769 14.3898C15.4347 14.3901 15.2938 14.3624 15.1624 14.3081C15.0309 14.2539 14.9115 14.1742 14.811 14.0736C14.7104 13.9731 14.6307 13.8537 14.5765 13.7222C14.5222 13.5908 14.4945 13.4499 14.4948 13.3077C14.4946 13.1655 14.5224 13.0247 14.5767 12.8933C14.6309 12.7619 14.7106 12.6425 14.8112 12.5419C14.9117 12.4414 15.0311 12.3617 15.1625 12.3074C15.2939 12.2531 15.4347 12.226 15.5769 12.2263Z"
                                        fill="#B7B7B7" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_1_3168">
                                        <rect width="18" height="18" fill="white" transform="translate(0 0.5)" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </div>
                        <div @click="channelBtn = 2, channelBtnActive = true" :class="{ 'active': channelBtn == 2 }"
                            class="d-flex chan align-items-center w-100 justify-content-between gap-2">
                            <span> Bein sports </span>
                            <svg xmlns="http://www.w3.org/2000/svg" width="18" height="19" viewBox="0 0 18 19" fill="none">
                                <g clip-path="url(#clip0_1_3168)">
                                    <path
                                        d="M13.7596 0.499996C13.6045 0.516667 13.4596 0.585216 13.3484 0.694534L9 5.04361L6.72854 2.77077C6.66308 2.70535 6.58538 2.65347 6.49987 2.61809C6.41436 2.5827 6.32272 2.56451 6.23018 2.56454C6.13764 2.56457 6.04601 2.58283 5.96053 2.61827C5.87504 2.65372 5.79738 2.70565 5.73196 2.77111C5.59985 2.90331 5.52567 3.08258 5.52574 3.26947C5.52577 3.36201 5.54403 3.45364 5.57947 3.53912C5.61491 3.62461 5.66685 3.70227 5.73231 3.76769L8.00446 6.03846H2.07692C1.52609 6.03846 0.997815 6.25728 0.608317 6.64677C0.218818 7.03627 0 7.56455 0 8.11538L0 16.4231C0 16.9739 0.218818 17.5022 0.608317 17.8917C0.997815 18.2812 1.52609 18.5 2.07692 18.5H15.9231C16.4739 18.5 17.0022 18.2812 17.3917 17.8917C17.7812 17.5022 18 16.9739 18 16.4231V8.11538C18 7.56455 17.7812 7.03627 17.3917 6.64677C17.0022 6.25728 16.4739 6.03846 15.9231 6.03846H9.99485L14.3439 1.69007C14.4529 1.58879 14.5263 1.4551 14.5533 1.30882C14.5804 1.16254 14.5595 1.01144 14.494 0.877913C14.4284 0.744382 14.3216 0.63552 14.1893 0.567452C14.0571 0.499384 13.9064 0.475731 13.7596 0.499996ZM7.26923 7.42307C12.4235 7.42307 13.1538 7.43761 13.1538 12.2692C13.1538 17.1015 12.3729 17.1154 7.26923 17.1154C2.142 17.1154 1.38462 17.0641 1.38462 12.2692C1.38462 7.47569 2.142 7.42307 7.26923 7.42307ZM15.5769 9.45707C16.1765 9.45707 16.659 9.93892 16.659 10.5385C16.6593 10.6806 16.6315 10.8215 16.5772 10.9529C16.5229 11.0843 16.4432 11.2037 16.3427 11.3042C16.2421 11.4047 16.1227 11.4844 15.9913 11.5387C15.8599 11.593 15.7191 11.6208 15.5769 11.6205C15.4347 11.6209 15.2938 11.5932 15.1624 11.5389C15.0309 11.4847 14.9115 11.405 14.811 11.3044C14.7104 11.2039 14.6307 11.0844 14.5765 10.953C14.5222 10.8215 14.4945 10.6807 14.4948 10.5385C14.4946 10.3963 14.5224 10.2554 14.5767 10.124C14.6309 9.99263 14.7106 9.87324 14.8112 9.7727C14.9117 9.67217 15.0311 9.59247 15.1625 9.53819C15.2939 9.48391 15.4347 9.4568 15.5769 9.45707ZM15.5769 12.2263C16.1765 12.2263 16.659 12.7082 16.659 13.3077C16.6593 13.4499 16.6315 13.5907 16.5772 13.7221C16.5229 13.8535 16.4432 13.9729 16.3427 14.0734C16.2421 14.174 16.1227 14.2537 15.9913 14.308C15.8599 14.3622 15.7191 14.39 15.5769 14.3898C15.4347 14.3901 15.2938 14.3624 15.1624 14.3081C15.0309 14.2539 14.9115 14.1742 14.811 14.0736C14.7104 13.9731 14.6307 13.8537 14.5765 13.7222C14.5222 13.5908 14.4945 13.4499 14.4948 13.3077C14.4946 13.1655 14.5224 13.0247 14.5767 12.8933C14.6309 12.7619 14.7106 12.6425 14.8112 12.5419C14.9117 12.4414 15.0311 12.3617 15.1625 12.3074C15.2939 12.2531 15.4347 12.226 15.5769 12.2263Z"
                                        fill="#B7B7B7" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_1_3168">
                                        <rect width="18" height="18" fill="white" transform="translate(0 0.5)" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </div>
                        <div @click="channelBtn = 3, channelBtnActive = true" :class="{ 'active': channelBtn == 3 }"
                            class="d-flex chan align-items-center w-100 justify-content-between  gap-2">
                            <span> Sport Premium </span>
                            <svg xmlns="http://www.w3.org/2000/svg" width="18" height="19" viewBox="0 0 18 19" fill="none">
                                <g clip-path="url(#clip0_1_3168)">
                                    <path
                                        d="M13.7596 0.499996C13.6045 0.516667 13.4596 0.585216 13.3484 0.694534L9 5.04361L6.72854 2.77077C6.66308 2.70535 6.58538 2.65347 6.49987 2.61809C6.41436 2.5827 6.32272 2.56451 6.23018 2.56454C6.13764 2.56457 6.04601 2.58283 5.96053 2.61827C5.87504 2.65372 5.79738 2.70565 5.73196 2.77111C5.59985 2.90331 5.52567 3.08258 5.52574 3.26947C5.52577 3.36201 5.54403 3.45364 5.57947 3.53912C5.61491 3.62461 5.66685 3.70227 5.73231 3.76769L8.00446 6.03846H2.07692C1.52609 6.03846 0.997815 6.25728 0.608317 6.64677C0.218818 7.03627 0 7.56455 0 8.11538L0 16.4231C0 16.9739 0.218818 17.5022 0.608317 17.8917C0.997815 18.2812 1.52609 18.5 2.07692 18.5H15.9231C16.4739 18.5 17.0022 18.2812 17.3917 17.8917C17.7812 17.5022 18 16.9739 18 16.4231V8.11538C18 7.56455 17.7812 7.03627 17.3917 6.64677C17.0022 6.25728 16.4739 6.03846 15.9231 6.03846H9.99485L14.3439 1.69007C14.4529 1.58879 14.5263 1.4551 14.5533 1.30882C14.5804 1.16254 14.5595 1.01144 14.494 0.877913C14.4284 0.744382 14.3216 0.63552 14.1893 0.567452C14.0571 0.499384 13.9064 0.475731 13.7596 0.499996ZM7.26923 7.42307C12.4235 7.42307 13.1538 7.43761 13.1538 12.2692C13.1538 17.1015 12.3729 17.1154 7.26923 17.1154C2.142 17.1154 1.38462 17.0641 1.38462 12.2692C1.38462 7.47569 2.142 7.42307 7.26923 7.42307ZM15.5769 9.45707C16.1765 9.45707 16.659 9.93892 16.659 10.5385C16.6593 10.6806 16.6315 10.8215 16.5772 10.9529C16.5229 11.0843 16.4432 11.2037 16.3427 11.3042C16.2421 11.4047 16.1227 11.4844 15.9913 11.5387C15.8599 11.593 15.7191 11.6208 15.5769 11.6205C15.4347 11.6209 15.2938 11.5932 15.1624 11.5389C15.0309 11.4847 14.9115 11.405 14.811 11.3044C14.7104 11.2039 14.6307 11.0844 14.5765 10.953C14.5222 10.8215 14.4945 10.6807 14.4948 10.5385C14.4946 10.3963 14.5224 10.2554 14.5767 10.124C14.6309 9.99263 14.7106 9.87324 14.8112 9.7727C14.9117 9.67217 15.0311 9.59247 15.1625 9.53819C15.2939 9.48391 15.4347 9.4568 15.5769 9.45707ZM15.5769 12.2263C16.1765 12.2263 16.659 12.7082 16.659 13.3077C16.6593 13.4499 16.6315 13.5907 16.5772 13.7221C16.5229 13.8535 16.4432 13.9729 16.3427 14.0734C16.2421 14.174 16.1227 14.2537 15.9913 14.308C15.8599 14.3622 15.7191 14.39 15.5769 14.3898C15.4347 14.3901 15.2938 14.3624 15.1624 14.3081C15.0309 14.2539 14.9115 14.1742 14.811 14.0736C14.7104 13.9731 14.6307 13.8537 14.5765 13.7222C14.5222 13.5908 14.4945 13.4499 14.4948 13.3077C14.4946 13.1655 14.5224 13.0247 14.5767 12.8933C14.6309 12.7619 14.7106 12.6425 14.8112 12.5419C14.9117 12.4414 15.0311 12.3617 15.1625 12.3074C15.2939 12.2531 15.4347 12.226 15.5769 12.2263Z"
                                        fill="#B7B7B7" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_1_3168">
                                        <rect width="18" height="18" fill="white" transform="translate(0 0.5)" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </div>
                    </div>

                </div>


                <div v-if="channelBtnActive" class="channels">
                    <div v-if="channelBtn == 1" class="main">
                        <div class="image">
                            <img src="../assets/images/channel.png" alt="">
                        </div>
                        <div class="text">
                            <span> المعلق : </span>
                            <h6> حسن العيدروس </h6>
                        </div>
                        <div class="details">
                            <div class="head"> <span> الترددات الفضائية والأرضية </span> </div>
                            <div class="table-responsive">
                                <table class="table">
                                    <thead>
                                        <tr>
                                            <th scope="col">القمر</th>
                                            <th scope="col">التردد</th>
                                            <th scope="col">الاستقطاب</th>
                                            <th scope="col">الترميز</th>
                                            <th scope="col">التصحيح</th>
                                            <th scope="col">التشفير</th>

                                        </tr>
                                    </thead>
                                    <tbody>
                                        <tr v-for="i, index in 2">
                                            <td class="act" scope=""> Thor 2/3 | 0.8 غرب </td>
                                            <td class="act">
                                                10747
                                            </td>
                                            <td class="act"> أفقي </td>
                                            <td class="act">25000</td>
                                            <td class="act">3/4</td>
                                            <td class="act">كونكاس</td>
                                        </tr>
                                    </tbody>
                                </table>
                            </div>
                        </div>
                    </div>
                    <div v-if="channelBtn == 2" class="main">
                        <div class="image">
                            <img src="../assets/images/channel.png" alt="">
                        </div>
                        <div class="text">
                            <span> المعلق : </span>
                            <h6> حسن العيدروس </h6>
                        </div>
                        <div class="details">
                            <div class="head"> <span> الترددات الفضائية والأرضية </span> </div>
                            <div class="table-responsive">
                                <table class="table">
                                    <thead>
                                        <tr>
                                            <th scope="col">القمر</th>
                                            <th scope="col">التردد</th>
                                            <th scope="col">الاستقطاب</th>
                                            <th scope="col">الترميز</th>
                                            <th scope="col">التصحيح</th>
                                            <th scope="col">التشفير</th>

                                        </tr>
                                    </thead>
                                    <tbody>
                                        <tr v-for="i, index in 2">
                                            <td class="act" scope=""> Thor 2/3 | 0.8 غرب </td>
                                            <td class="act">
                                                10747
                                            </td>
                                            <td class="act"> أفقي </td>
                                            <td class="act">25000</td>
                                            <td class="act">3/4</td>
                                            <td class="act">كونكاس</td>
                                        </tr>
                                    </tbody>
                                </table>
                            </div>
                        </div>
                    </div>
                    <div v-if="channelBtn == 3" class="main">
                        <div class="image">
                            <img src="../assets/images/channel.png" alt="">
                        </div>
                        <div class="text">
                            <span> المعلق : </span>
                            <h6> حسن العيدروس </h6>
                        </div>
                        <div class="details">
                            <div class="head"> <span> الترددات الفضائية والأرضية </span> </div>
                            <div class="table-responsive">
                                <table class="table">
                                    <thead>
                                        <tr>
                                            <th scope="col">القمر</th>
                                            <th scope="col">التردد</th>
                                            <th scope="col">الاستقطاب</th>
                                            <th scope="col">الترميز</th>
                                            <th scope="col">التصحيح</th>
                                            <th scope="col">التشفير</th>

                                        </tr>
                                    </thead>
                                    <tbody>
                                        <tr v-for="i, index in 2">
                                            <td class="act" scope=""> Thor 2/3 | 0.8 غرب </td>
                                            <td class="act">
                                                10747
                                            </td>
                                            <td class="act"> أفقي </td>
                                            <td class="act">25000</td>
                                            <td class="act">3/4</td>
                                            <td class="act">كونكاس</td>
                                        </tr>
                                    </tbody>
                                </table>
                            </div>
                        </div>
                    </div>
                </div>
                <div class="match-details">
                    <div class="head">
                        <span> تاريخ مواجهة الفريقين ( آخر 5مباريات ) </span>
                    </div>
                    <div class="stat">
                        <img src="../assets/images/clup4.png" />

                        <h5> إحصائيات </h5>

                        <img src="../assets/images/clup5.png" />
                    </div>

                    <div class="main-text">
                        <div class="text-container">
                            <span class="num"> 3 </span>
                            <span> فوز </span>
                            <span class="num"> 2 </span>
                        </div>
                        <div class="text-container">
                            <span class="num"> 3 </span>
                            <span> تعادل </span>
                            <span class="num"> 2 </span>
                        </div>
                        <div class="text-container">
                            <span class="num"> 3 </span>
                            <span> هزيمة </span>
                            <span class="num"> 2 </span>
                        </div>
                        <div class="text-container">
                            <span class="num"> 3 </span>
                            <span> الأهداف </span>
                            <span class="num"> 2 </span>
                        </div>

                    </div>


                    <div class="details">
                        <div v-for="i in 5" class="main-box ">
                            <div class="mobile-box d-block d-xl-none d-lg-none">
                                <div class="d-flex text w-100 align-items-center justify-content-center gap-5">
                                    <span> 30 ديسمبر 2023 </span>
                                    <span> الدوري السعودي </span>
                                </div>
                                <div class="clups">
                                    <div class="d-flex align-items-center gap-2">
                                        <span> الأخدود </span>
                                        <span> 2 </span>
                                    </div>
                                    <div class="divider"></div>
                                    <div class="d-flex align-items-center gap-2">
                                        <span> الأخدود </span>
                                        <span> 2 </span>
                                    </div>
                                </div>
                            </div>
                            <div class="boxes d-none d-xl-flex d-lg-flex w-100 align-items-center justify-content-between">
                                <div class="box text-center">
                                    <span style="width: 100%;"> 30 ديسمبر 2023 </span>
                                    <span class="act"> الفتح </span>
                                    <span class="act"> 2 </span>
                                </div>
                                <div class="divider d-none d-xl-block d-lg-block"></div>
                                <div class="box text-center">
                                    <span> 0 </span>
                                    <span class="act"> ريال مدريد </span>
                                    <span class="act2 "> الدوري السعودي </span>
                                </div>

                            </div>
                        </div>
                    </div>
                </div>

                <div class="match-details act">
                    <div class="head">
                        <span> موقف الفريقين في الدوري السعودي </span>
                    </div>
                    <div class="table-responsive">
                        <table class="table">
                            <thead>
                                <tr>
                                    <th scope="col">المركز</th>
                                    <th scope="col">الفريق</th>
                                    <th scope="col">لعب</th>
                                    <th scope="col">فوز</th>
                                    <th scope="col">تعادل</th>
                                    <th scope="col">هزيمة</th>
                                    <th scope="col">له</th>
                                    <th scope="col">عليه</th>
                                    <th scope="col">النقاط</th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr v-for="i, index in 2">
                                    <td class="act" scope="">{{ index + 1 }} </td>
                                    <td class="act">
                                        <div class="d-flex align-items-center gap-2 image">
                                            <img src="../assets/images/clup2.png" alt="">
                                            <span> الهلال </span>

                                        </div>
                                    </td>
                                    <td class="act">19</td>
                                    <td class="act">17</td>
                                    <td class="act">2</td>
                                    <td class="act">0</td>
                                    <td class="act">59</td>
                                    <td class="act">9</td>
                                    <td class="fw-bolder act">53</td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>

            </div>

        </div>
    </div>
</template>

<script setup>

import { ref, onMounted } from 'vue';

let channelBtn = ref(0);
let channelBtnActive = ref(false);

</script>

<style lang="scss" scoped></style>